notes/recitation-1.org
* Review of publishing using Emacs
Notes from last class:

 [[elisp:(find-file (expand-file-name "examples" starter-kit-dir))]]

LaTeX is the basis of all document publication that Emacs performs. Here, we review some LaTeX syntax.

** '\\' - Line break
Line breaks are most commonly used in equations with multiple lines.

Equations with line breaks:

Type C-c c-x-l to toggle the images

\begin{align}
&OVac\_FormE(cID) \rightarrow OVac\_FormE(mID, mag, num\_atoms, \nonumber \\
&orientation, correction, calc\_quantity,\nonumber \\
&calculator, figure) \label{eq:multiline}
\end{align}

Equation without:

\begin{align}
OVac\_FormE(cID) \rightarrow OVac\_FormE(mID, mag, num\_atoms,
orientation, correction, calc\_quantity,
calculator, figure) \label{eq:multiline}
\end{align}

NOTE: The '&' symbol indicates where you would like to align the equation. for example:

\begin{align}
Equation & = blah \\
& = blah blah \\
& = blah blah blah \\
\end{align}

** '\' - Forced spacing in equations
Sometimes you would like to add space into your equations. This can be done using a single slash:

\begin{align}
Equation & = blah \\
& = blah \ blah \\
= blah & \ blah \ blah \\
\end{align}

** Publish the file
C-c e o  will start the vanilla export. You get a menu of options. Press l o to make and open a pdf (via LaTeX), or h o to make and open an html file. Note, you may need latex_header tags for some packages. org does some things by default, but not everything.



* Review of VASP tags and their purpose
It's important to keep in mind that the purpose of VASP is to implement the Kohn-Sham equations in order to solve for properties of interested for various atomic configurations.

All of the tags we implement are a means to that end.

** XC and GGA
Hopefully, this one is pretty self explanatory.

The exchange correlation functional is every part of the Kohn-Sham equation that we don't know the exact solution for. So, it needs to be approximated.

We do this by setting the XC tag to either 'LDA' (Local-Density Approximation), or 'PBE' (Perdew, Burke, and Ernzerhof).

#+BEGIN_SRC python :results silent
from jasp import *
from ase.structure import molecule

atoms = molecule('H2')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-pbe',
          xc='PBE',
          atoms=atoms) as calc:
    try:

    calc.initialize(atoms)
    calc.write_potcar()
#+END_SRC

The GGA tag stands for generalized gradient approximation. This is a class of functionals which include gradients (As opposed to LDA which is constant).

Here are a list of all the functionals you may use in the future:
http://cms.mpi.univie.ac.at/vasp/vasp/GGA_tag.html

91	Perdew -Wang 91
PE	Perdew-Burke-Ernzerhof
RP	revised Perdew-Burke-Ernzerhof
AM	AM05
PS	Perdew-Burke-Ernzerhof revised for solids

When implementing the GGA tag, it is recommended that you set xc equal to 'LDA' as follows:

#+BEGIN_SRC python :results silent
from jasp import *
from ase.structure import molecule

atoms = molecule('H2')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-ps',
          xc='LDA',
          gga='PS',
          atoms=atoms) as calc:

    calc.initialize(atoms)
    calc.write_potcar()
#+END_SRC


The POTCAR contains all of the information needed to calculate the Kohn-Sham equations for the atoms in your atoms object for a specific functional.

The XC tag tells VASP where to get the POTCAR information from. The producers of VASP have specifically tailored these files to calculate energies for each atom type quickly and effectively.

These files are what separate VASP from other codes which perform molecular simulation studies.

