notes/recitation-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>recitation-1</title>
<!-- 2016-02-16 Tue 09:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Kitchin" />
</head>
<body>
<div id="content">
<h1 class="title">recitation-1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Review of publishing using Emacs</a>
<ul>
<li><a href="#sec-1-1">1.1. '\\' - Line break</a></li>
<li><a href="#sec-1-2">1.2. '\' - Forced spacing in equations</a></li>
<li><a href="#sec-1-3">1.3. Publish the file</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Review of VASP tags and their purpose</a>
<ul>
<li><a href="#sec-2-1">2.1. XC and GGA</a></li>
<li><a href="#sec-2-2">2.2. VASP 'behind the scenes'</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. #1 - initializing the atoms object</a></li>
<li><a href="#sec-2-2-2">2.2.2. #2 - writing the POSCAR</a></li>
<li><a href="#sec-2-2-3">2.2.3. #3 - writing the INCAR</a></li>
<li><a href="#sec-2-2-4">2.2.4. #4 - writing the POTCAR</a></li>
<li><a href="#sec-2-2-5">2.2.5. #5 - writing the KPOINTS</a></li>
<li><a href="#sec-2-2-6">2.2.6. #6 - writing the ASE sorting order</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. How to set up a master bibliography file</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Review of publishing using Emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
Notes from last class:
</p>

<p>
<a href="(find-file (expand-file-name "examples" starter-kit-dir))">(find-file (expand-file-name "examples" starter-kit-dir))</a>
</p>

<p>
LaTeX is the basis of all document publication that Emacs performs. Here, we review some LaTeX syntax.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> '\\' - Line break</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Line breaks are most commonly used in equations with multiple lines.
</p>

<p>
Equations with line breaks:
</p>

<p>
Type C-c C-x C-l to toggle the images
</p>

<p>
inline math
\(x^2 = 4\)
</p>

<p>
\(x^3 = 27\)
</p>

<p>
display math
\[x^4 = 16\]
</p>

\begin{align}
OVac\_FormE(cID) \rightarrow OVac\_FormE(&mID, mag, num\_atoms, \nonumber \\
&orientation, correction, calc\_quantity,\nonumber \\
&calculator, figure) \label{eq:multiline}
\end{align}

<p>
Equation without:
</p>

\begin{align}
OVac\_FormE(cID) \rightarrow & OVac\_FormE(mID, mag, num\_atoms,
&orientation, correction, calc\_quantity,
&calculator, figure) \label{eq:multiline}
\end{align}

<p>
NOTE: The '&amp;' symbol indicates where you would like to align the equation. for example:
</p>

\begin{align}
Equation & = blah \\
& = blah blah \\
& = blah blah blah \\
\end{align}
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> '\' - Forced spacing in equations</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Sometimes you would like to add space into your equations. This can be done using a single slash:
</p>

\begin{align}
Equation & = blah \\
& = blah \ blah \\
& = blah \ blah \ blah \\
\end{align}
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Publish the file</h3>
<div class="outline-text-3" id="text-1-3">
<p>
C-c e o  will start the vanilla export. You get a menu of options. Press l o to make and open a pdf (via LaTeX), or h o to make and open an html file. Note, you may need latex_header tags for some packages. org does some things by default, but not everything.
</p>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Review of VASP tags and their purpose</h2>
<div class="outline-text-2" id="text-2">
<p>
It's important to keep in mind that the purpose of VASP is to implement the Kohn-Sham equations in order to solve for properties of interested for various atomic configurations.
</p>

<p>
All of the tags we implement are a means to that end.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> XC and GGA</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Hopefully, this one is pretty self explanatory.
</p>

<p>
The exchange correlation functional is every part of the Kohn-Sham equation that we don't know the exact solution for. So, it needs to be approximated.
</p>

<p>
We do this by setting the XC tag to either 'LDA' (Local-Density Approximation), or 'PBE' (Perdew, Burke, and Ernzerhof).
</p>

<div class="org-src-container">

<pre class="src src-python">from jasp import *
from ase.structure import molecule

atoms = molecule('H2')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-pbe',
          xc='PBE',
          atoms=atoms) as calc:
    try:

    calc.initialize(atoms)
    calc.write_potcar()
</pre>
</div>

<p>
The GGA tag stands for generalized gradient approximation. This is a class of functionals which include gradients (As opposed to LDA which is constant).
</p>

<p>
Here are a list of all the functionals you may use in the future:
<a href="http://cms.mpi.univie.ac.at/vasp/vasp/GGA_tag.html">http://cms.mpi.univie.ac.at/vasp/vasp/GGA_tag.html</a>
</p>

<p>
91        Perdew -Wang 91
PE        Perdew-Burke-Ernzerhof
RP        revised Perdew-Burke-Ernzerhof
AM        AM05
PS        Perdew-Burke-Ernzerhof revised for solids
</p>

<p>
When implementing the GGA tag, it is recommended that you set xc equal to 'LDA' as follows:
</p>

<div class="org-src-container">

<pre class="src src-python">from jasp import *
from ase.structure import molecule

atoms = molecule('H2')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-ps',
          xc='LDA',
          gga='PS',
          atoms=atoms) as calc:

    calc.initialize(atoms)
    calc.write_potcar()
</pre>
</div>


<p>
The POTCAR contains all of the information needed to calculate the Kohn-Sham equations for the atoms in your atoms object for a specific functional.
</p>

<p>
The XC tag tells VASP where to get the POTCAR information from. The producers of VASP have specifically tailored these files to calculate energies for each atom type quickly and effectively.
</p>

<p>
These files are what separate VASP from other codes which perform molecular simulation studies.
</p>
</div>
</div>
