notes/recitation-1.tex
% Created 2016-02-16 Tue 09:19
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\author{John Kitchin}
\date{\today}
\title{recitation-1}
\begin{document}

\tableofcontents

\section{Review of publishing using Emacs}
\label{sec-1}
Notes from last class:

\url{(find-file (expand-file-name "examples" starter-kit-dir))}

\LaTeX{} is the basis of all document publication that Emacs performs. Here, we review some \LaTeX{} syntax.

\subsection{'\\' - Line break}
\label{sec-1-1}
Line breaks are most commonly used in equations with multiple lines.

Equations with line breaks:

Type C-c C-x C-l to toggle the images

inline math
$x^2 = 4$

\(x^3 = 27\)

display math
\[x^4 = 16\]

\begin{align}
OVac\_FormE(cID) \rightarrow OVac\_FormE(&mID, mag, num\_atoms, \nonumber \\
&orientation, correction, calc\_quantity,\nonumber \\
&calculator, figure) \label{eq:multiline}
\end{align}

Equation without:

\begin{align}
OVac\_FormE(cID) \rightarrow & OVac\_FormE(mID, mag, num\_atoms,
&orientation, correction, calc\_quantity,
&calculator, figure) \label{eq:multiline}
\end{align}

NOTE: The '\&' symbol indicates where you would like to align the equation. for example:

\begin{align}
Equation & = blah \\
& = blah blah \\
& = blah blah blah \\
\end{align}

\subsection{'$\backslash$' - Forced spacing in equations}
\label{sec-1-2}
Sometimes you would like to add space into your equations. This can be done using a single slash:

\begin{align}
Equation & = blah \\
& = blah \ blah \\
& = blah \ blah \ blah \\
\end{align}

\subsection{Publish the file}
\label{sec-1-3}
C-c e o  will start the vanilla export. You get a menu of options. Press l o to make and open a pdf (via \LaTeX{}), or h o to make and open an html file. Note, you may need latex\_header tags for some packages. org does some things by default, but not everything.



\section{Review of VASP tags and their purpose}
\label{sec-2}
It's important to keep in mind that the purpose of VASP is to implement the Kohn-Sham equations in order to solve for properties of interested for various atomic configurations.

All of the tags we implement are a means to that end.

\subsection{XC and GGA}
\label{sec-2-1}
Hopefully, this one is pretty self explanatory.

The exchange correlation functional is every part of the Kohn-Sham equation that we don't know the exact solution for. So, it needs to be approximated.

We do this by setting the XC tag to either 'LDA' (Local-Density Approximation), or 'PBE' (Perdew, Burke, and Ernzerhof).

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{python}
from jasp import *
from ase.structure import molecule

atoms = molecule('H2')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-pbe',
          xc='PBE',
          atoms=atoms) as calc:
    try:

    calc.initialize(atoms)
    calc.write_potcar()
\end{minted}

The GGA tag stands for generalized gradient approximation. This is a class of functionals which include gradients (As opposed to LDA which is constant).

Here are a list of all the functionals you may use in the future:
\url{http://cms.mpi.univie.ac.at/vasp/vasp/GGA_tag.html}

91        Perdew -Wang 91
PE        Perdew-Burke-Ernzerhof
RP        revised Perdew-Burke-Ernzerhof
AM        AM05
PS        Perdew-Burke-Ernzerhof revised for solids

When implementing the GGA tag, it is recommended that you set xc equal to 'LDA' as follows:

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{python}
from jasp import *
from ase.structure import molecule

atoms = molecule('H2')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-ps',
          xc='LDA',
          gga='PS',
          atoms=atoms) as calc:

    calc.initialize(atoms)
    calc.write_potcar()
\end{minted}


The POTCAR contains all of the information needed to calculate the Kohn-Sham equations for the atoms in your atoms object for a specific functional.

The XC tag tells VASP where to get the POTCAR information from. The producers of VASP have specifically tailored these files to calculate energies for each atom type quickly and effectively.

These files are what separate VASP from other codes which perform molecular simulation studies.
