notes/recitation-1.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> VASP 'behind the scenes'</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Notice in the previous example, I've used JASP to only produce one of the initialization files needed for a VASP calculations.
</p>

<p>
Keep in mind that JASP is only a 'wrapper' for VASP!
</p>

<p>
i.e. JASP is a fancy interface, designed to make VASP easier to use
</p>

<p>
e.g. without JASP and ASE (Atomic Simulation Environment), we would need to make these input files manually!
</p>

<p>
We can use JASP for all of the Initialization files needed to run a VASP calculation.
</p>

<p>
The following code block shows the calculation initialization commands being run every time you start a new calculation:
</p>

<div class="org-src-container">

<pre class="src src-python">from jasp import *
from ase.structure import molecule

atoms = molecule('CH4')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-initial',
          xc='PBE',
          gga='PS',
          ibrion=-1,
          atoms=atoms) as calc:

    calc.initialize(atoms)  #1
    write_vasp('POSCAR',
               calc.atoms_sorted,
               symbol_count=calc.symbol_count)  #2
    calc.write_incar(atoms)  #3
    calc.write_potcar()  #4
    calc.write_kpoints()  #5
    calc.write_sort_file()  #6
</pre>
</div>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> #1 - initializing the atoms object</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Running this function defines a large number of variables based on the atoms object
</p>

<p>
These variables will be utilized by JASP and ASE later to create the other initialization files
</p>

<p>
JASP also creates a METADATA file here, to record meta-information about the calculation:
<a href="./molecules/func-initial/METADATA">./molecules/func-initial/METADATA</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> #2 - writing the POSCAR</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
This code generates a POSCAR file using ASEs atom sorting tool
</p>

<p>
POSCAR is fancy coder abbreviation for POSition Component Application Recourse, which is fancy speak for 'information about atom positions'
</p>

<p>
The ASE atoms sorter is used to collapse like atoms together so the POTCAR can be written into one succinct  file.
</p>

<p>
Without this sorting feature, each atom would need its OWN POTCAR. 50 atom unit cell? 50 identical POTCAR files.
</p>

<p>
Here's what the POSCAR file looks like:
<a href="./molecules/func-initial/POSCAR">./molecules/func-initial/POSCAR</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> #3 - writing the INCAR</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This code writes the INCAR file needed to start a VASP calculation
</p>

<p>
Like POSCAR, this file is another abbreviation for INput Component Application Recourse, i.e. calculation inputs
</p>

<p>
This file contains all of the input parameters specific to your calculation, and will likely look very familiar to you:
<a href="./molecules/func-initial/INCAR">./molecules/func-initial/INCAR</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> #4 - writing the POTCAR</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Writes the POTential Component Application Recourse file.
</p>

<p>
As described above, this file contains the nuts and bolts of what makes VASP unique
</p>

<p>
There is information about how to solve the Kohn-Sham equation specific to the functional being used
</p>

<p>
There is also an entry for each type of atom in your atoms object!
</p>

<p>
Try searching for 'PAW_PBE' in this file to see what I mean:
<a href="./molecules/func-initial/POTCAR">./molecules/func-initial/POTCAR</a>
</p>

<p>
The POSCAR and POTCAR files must be generated together, since ASE uses special sorting methods to represent all of the atoms in the POSCAR in <i>one</i> POTCAR file.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> #5 - writing the KPOINTS</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
<i>k</i>-points are used to sample the Brillouin zone (<a href="http://en.wikipedia.org/wiki/Brillouin_zone">http://en.wikipedia.org/wiki/Brillouin_zone</a>) of a lattice to discretely measure characteristics of a continuous lattice
</p>

<p>
You may not have know this existed yet, because we don't need more than one <i>k</i>-point for molecule simulation!
</p>

<p>
Notice that the KPOINTS file generate has 1 <i>k</i>-point by default
<a href="./molecules/func-initial/KPOINTS">./molecules/func-initial/KPOINTS</a>
</p>

<p>
This file is essential for ANY VASP calculation. Don't believe me? Go back and look in one of your old calculation folders.
</p>

<p>
We will discuss <i>k</i>-points more when we get into bulk systems next class
</p>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> #6 - writing the ASE sorting order</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
The ASE sorting utility is useful for collapsing the POTCAR into one file
</p>

<p>
The ASE sorting file helps ASE keep track of potential differences between indices of atoms in your hand made atoms objects, and the order that ASE prefers for simplifying the POTCAR file.
</p>

<p>
In this case, there is no difference, perhaps since the atoms object was generated using ASE:
<a href="./molecules/func-initial/ase-sort.dat">./molecules/func-initial/ase-sort.dat</a>
</p>
</div>
</div>
</div>
</div>
