notes/recitation-1.tex

\subsection{VASP 'behind the scenes'}
\label{sec-2-2}
Notice in the previous example, I've used JASP to only produce one of the initialization files needed for a VASP calculations.

Keep in mind that JASP is only a 'wrapper' for VASP!

i.e. JASP is a fancy interface, designed to make VASP easier to use

e.g. without JASP and ASE (Atomic Simulation Environment), we would need to make these input files manually!

We can use JASP for all of the Initialization files needed to run a VASP calculation.

The following code block shows the calculation initialization commands being run every time you start a new calculation:

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{python}
from jasp import *
from ase.structure import molecule

atoms = molecule('CH4')
atoms.set_cell([6, 6, 6])
atoms.center()

with jasp('./molecules/func-initial',
          xc='PBE',
          gga='PS',
          ibrion=-1,
          atoms=atoms) as calc:

    calc.initialize(atoms)  #1
    write_vasp('POSCAR',
               calc.atoms_sorted,
               symbol_count=calc.symbol_count)  #2
    calc.write_incar(atoms)  #3
    calc.write_potcar()  #4
    calc.write_kpoints()  #5
    calc.write_sort_file()  #6
\end{minted}

\subsubsection{\#1 - initializing the atoms object}
\label{sec-2-2-1}
Running this function defines a large number of variables based on the atoms object

These variables will be utilized by JASP and ASE later to create the other initialization files

JASP also creates a METADATA file here, to record meta-information about the calculation:
\url{./molecules/func-initial/METADATA}

\subsubsection{\#2 - writing the POSCAR}
\label{sec-2-2-2}
This code generates a POSCAR file using ASEs atom sorting tool

POSCAR is fancy coder abbreviation for POSition Component Application Recourse, which is fancy speak for 'information about atom positions'

The ASE atoms sorter is used to collapse like atoms together so the POTCAR can be written into one succinct  file.

Without this sorting feature, each atom would need its OWN POTCAR. 50 atom unit cell? 50 identical POTCAR files.

Here's what the POSCAR file looks like:
\url{./molecules/func-initial/POSCAR}

\subsubsection{\#3 - writing the INCAR}
\label{sec-2-2-3}
This code writes the INCAR file needed to start a VASP calculation

Like POSCAR, this file is another abbreviation for INput Component Application Recourse, i.e. calculation inputs

This file contains all of the input parameters specific to your calculation, and will likely look very familiar to you:
\url{./molecules/func-initial/INCAR}

\subsubsection{\#4 - writing the POTCAR}
\label{sec-2-2-4}
Writes the POTential Component Application Recourse file.

As described above, this file contains the nuts and bolts of what makes VASP unique

There is information about how to solve the Kohn-Sham equation specific to the functional being used

There is also an entry for each type of atom in your atoms object!

Try searching for 'PAW\_PBE' in this file to see what I mean:
\url{./molecules/func-initial/POTCAR}

The POSCAR and POTCAR files must be generated together, since ASE uses special sorting methods to represent all of the atoms in the POSCAR in \emph{one} POTCAR file.

\subsubsection{\#5 - writing the KPOINTS}
\label{sec-2-2-5}
\emph{k}-points are used to sample the Brillouin zone (\url{http://en.wikipedia.org/wiki/Brillouin_zone}) of a lattice to discretely measure characteristics of a continuous lattice

You may not have know this existed yet, because we don't need more than one \emph{k}-point for molecule simulation!

Notice that the KPOINTS file generate has 1 \emph{k}-point by default
\url{./molecules/func-initial/KPOINTS}

This file is essential for ANY VASP calculation. Don't believe me? Go back and look in one of your old calculation folders.

We will discuss \emph{k}-points more when we get into bulk systems next class

\subsubsection{\#6 - writing the ASE sorting order}
\label{sec-2-2-6}
The ASE sorting utility is useful for collapsing the POTCAR into one file

The ASE sorting file helps ASE keep track of potential differences between indices of atoms in your hand made atoms objects, and the order that ASE prefers for simplifying the POTCAR file.

In this case, there is no difference, perhaps since the atoms object was generated using ASE:
\url{./molecules/func-initial/ase-sort.dat}
