notes/recitation-1.html


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How to set up a master bibliography file</h2>
<div class="outline-text-2" id="text-3">
<p>
Inside your jmax directory there is a folder called user
</p>

<p>
All emacs-lisp code lines in this folder are automatically loaded every time you open emacs
</p>

<p>
Inside this file, you can create a custom folder to load special modules that you enjoy in emacs:
</p>

<p>
Here is a code block you can run to generate a master bibliography setup in your home directory:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(unless (file-exists-p "~/bibliography")
  (make-directory "~/bibliography"))

(with-current-buffer (find-file-noselect
		      (expand-file-name
		       "user/my-bibliography.el" starter-kit-dir))
  (insert
   "(setq org-ref-bibliography-notes \"~/bibliography/notes.org\"
      org-ref-default-bibliography '(\"~/bibliography/references.bib\")
      org-ref-pdf-directory \"~/bibliography/bibtex-pdfs/\")
")
  (save-buffer)
  (kill-buffer))


(load-file (expand-file-name "user/my-bibliography.el" starter-kit-dir))
</pre>
</div>

<pre class="example">
t
</pre>

<p>
You only need to run that once, subsequent times you open emacs the new file will be automatically loaded.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Kitchin</p>
<p class="date">Created: 2016-02-16 Tue 09:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
