notes/recitation-1.tex


\section{How to set up a master bibliography file}
\label{sec-3}

Inside your jmax directory there is a folder called user

All emacs-lisp code lines in this folder are automatically loaded every time you open emacs

Inside this file, you can create a custom folder to load special modules that you enjoy in emacs:

Here is a code block you can run to generate a master bibliography setup in your home directory:

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{common-lisp}
(unless (file-exists-p "~/bibliography")
  (make-directory "~/bibliography"))

(with-current-buffer (find-file-noselect
		      (expand-file-name
		       "user/my-bibliography.el" starter-kit-dir))
  (insert
   "(setq org-ref-bibliography-notes \"~/bibliography/notes.org\"
      org-ref-default-bibliography '(\"~/bibliography/references.bib\")
      org-ref-pdf-directory \"~/bibliography/bibtex-pdfs/\")
")
  (save-buffer)
  (kill-buffer))


(load-file (expand-file-name "user/my-bibliography.el" starter-kit-dir))
\end{minted}

\begin{verbatim}
t
\end{verbatim}

You only need to run that once, subsequent times you open emacs the new file will be automatically loaded.
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}